---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetOnDuty
source: html/c5da7717-00c7-e8c9-6db4-4eec1b03954d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetOnDuty Property

"On Duty"

## Syntax (C#)
```csharp
public static ForgeTypeId MechanicalEquipmentSetOnDuty { get; }
```